In [ ]:
import pandas as pd

df = pd.read_csv('data/LEC_01_data.csv')

In [ ]:
df      # df 는 테이블 형태의 DataFrame

    Name Country  Age        Job
0   John     USA   31    Student
1  Sabre  France   33     Lawyer
2    Kim   Korea   28  Developer
3   Sato   Japan   40       Chef
4    Lee   Korea   36  Professor
5  Smith     USA   55        CEO
6  David     USA   48     Banker

In [ ]:
type(df)  # df 데이터 타입 확인

pandas.core.frame.DataFrame

In [ ]:
type(df.Name)   # df.Name 데이터 타입 확인

pandas.core.series.Series

In [ ]:
df

    Name Country  Age        Job
0   John     USA   31    Student
1  Sabre  France   33     Lawyer
2    Kim   Korea   28  Developer
3   Sato   Japan   40       Chef
4    Lee   Korea   36  Professor
5  Smith     USA   55        CEO
6  David     USA   48     Banker

In [ ]:
df_job = df['Job']

df_job

0      Student
1       Lawyer
2    Developer
3         Chef
4    Professor
5          CEO
6       Banker
Name: Job, dtype: object

In [ ]:
df_country_job = df[ ['Country', 'Job'] ]

df_country_job

  Country        Job
0     USA    Student
1  France     Lawyer
2   Korea  Developer
3   Japan       Chef
4   Korea  Professor
5     USA        CEO
6     USA     Banker

In [ ]:
df

    Name Country  Age        Job
0   John     USA   31    Student
1  Sabre  France   33     Lawyer
2    Kim   Korea   28  Developer
3   Sato   Japan   40       Chef
4    Lee   Korea   36  Professor
5  Smith     USA   55        CEO
6  David     USA   48     Banker

In [ ]:
df_1st_row = df.loc[0]

df_1st_row

Name          John
Country        USA
Age             31
Job        Student
Name: 0, dtype: object

In [ ]:
df_1st_4th_row = df.loc[ [0, 3] ]

df_1st_4th_row

   Name Country  Age      Job
0  John     USA   31  Student
3  Sato   Japan   40     Chef

In [ ]:
df

    Name Country  Age        Job
0   John     USA   31    Student
1  Sabre  France   33     Lawyer
2    Kim   Korea   28  Developer
3   Sato   Japan   40       Chef
4    Lee   Korea   36  Professor
5  Smith     USA   55        CEO
6  David     USA   48     Banker

In [ ]:
df_country_group = df.groupby('Country')

age_average = df_country_group['Age'].mean()

print(age_average)

Country
France    33.000000
Japan     40.000000
Korea     32.000000
USA       44.666667
Name: Age, dtype: float64